app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    raise SecurityError unless (params[:id].to_i == current_user.id) or current_user.is_admin?
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "email", "name", "pw", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 11 May 2012 11:07:15 UTC +00:00], ["email", "asadsysds"], ["name", "ablablabl"], ["pw", "ldaldsad"], ["updated_at", Fri, 11 May 2012 11:07:15 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def update
    raise SecurityError unless (params[:id].to_i == current_user.id) or current_user.is_admin?

    @user = User.find(params[:id])